ChillyTan/CIMC-Repository/GD32F4例程代码(苹果派)/进阶例程/04.SRAMAccess/App/ReadWriteSDRAM/ReadWriteSDRAM.c
/*********************************************************************************************************
* 模块名称：ReadWriteSDRAM.c
* 摘    要：读写SDRAM模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "ReadWriteSDRAM.h"
#include "gd32f470x_conf.h"
#include "GUITop.h"
#include "stdio.h"
#include "SDRAM.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define SDRAM_BASE_ADDR SDRAM_DEVICE0_ADDR     //SDRAM起始地址
#define SDRAM_BUFFER_SIZE    (2 * 1024)        //SDRAM缓冲区大小，2k字节
#define MAX_STRING_LEN         (64)            //显示字符最大长度

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructGUIDev s_structGUIDev;                                                  //GUI设备结构体
static u8   s_arrSDRAM[SDRAM_BUFFER_SIZE] __attribute__((at((u32)0xD1000000)));      //外部SDRAM缓冲区
static char s_arrStringBuff[MAX_STRING_LEN];                                         //字符串转换缓冲区

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static u8   ReadByte(u32 addr);             //读取特定地址数据（1字节）
static void WriteByte(u32 addr, u8 data);   //往特定地址内写入1字节数据
static void ReadSDRAM(u32 addr, u32 len);   //按字节读取SDRAM
static void WriteSDRAM(u32 addr, u8 data);  //按字节写入SDRAM

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ReadByte
* 函数功能：读取特定地址数据（1字节）
* 输入参数：addr：读取地址
* 输出参数：void
* 返 回 值：读到的数据
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static u8 ReadByte(u32 addr)
{
  return *(u8*)addr;
}

/*********************************************************************************************************
* 函数名称：WriteByte
* 函数功能：往特定地址内写入1字节数据
* 输入参数：addr：写入地址，data：写入数据（字节）
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void WriteByte(u32 addr, u8 data)
{
  *(u8*)addr = data;
}

/*********************************************************************************************************
* 函数名称：ReadSDRAM
* 函数功能：读取SDRAM
* 输入参数：addr：读取地址，len：读取长度（字节）
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void ReadSDRAM(u32 addr, u32 len)
{
  u32 i;    //循环变量
  u8  data; //读取到的数据

  //输出读取信息到终端和串口
  sprintf(s_arrStringBuff, "Read : 0x%08X - 0x%02X\r\n", addr, len);
  s_structGUIDev.showLine(s_arrStringBuff);
  printf("%s", s_arrStringBuff);

  //读取数据，并打印到终端和串口上
  for(i = 0; i < len; i++)
  {
    //读取
    data = ReadByte(addr + i);

    //输出
    sprintf(s_arrStringBuff, "0x%08X: 0x%02X\r\n", addr + i, data);
    s_structGUIDev.showLine(s_arrStringBuff);
    printf("%s", s_arrStringBuff);
  }
}

/*********************************************************************************************************
* 函数名称：WriteSDRAM
* 函数功能：按字节写入SDRAM
* 输入参数：addr：写入地址，data：写入数据
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
static void WriteSDRAM(u32 addr, u8 data)
{
  //将数据写入外部SDRAM
  if((addr >= s_structGUIDev.SDRAMBeginAddr) && (addr <= s_structGUIDev.SDRAMEndAddr))
  {
    //输出信息到终端和串口
    sprintf(s_arrStringBuff, "Write: 0x%08X - 0x%02X\r\n", addr, data);
    s_structGUIDev.showLine(s_arrStringBuff);
    printf("%s", s_arrStringBuff);

    //写入外部SDRAM
    WriteByte(addr, data);
  }
  else
  {
    //无效地址
    s_structGUIDev.showLine("Write: Invalid address\r\n");
    printf("Write: Invalid address\r\n");
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitReadWriteSDRAM
* 函数功能：初始化读写SDRAM模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void InitReadWriteSDRAM(void)
{
  u32 i;

  //获取外部SDRAM缓冲区首地址
  s_structGUIDev.SDRAMBeginAddr = (u32)s_arrSDRAM;

  //获取外部SDRAM缓冲区结束地址
  s_structGUIDev.SDRAMEndAddr = s_structGUIDev.SDRAMBeginAddr + sizeof(s_arrSDRAM) / sizeof(u8) - sizeof(u8);

  //设置写入回调函数
  s_structGUIDev.writeCallback = WriteSDRAM;

  //设置读取回调函数
  s_structGUIDev.readCallback = ReadSDRAM;

  //初始化UI界面设计
  InitGUI(&s_structGUIDev);

  //初始化外部SDRAM缓冲区
  for(i = 0; i < sizeof(s_arrSDRAM) / sizeof(u8); i++)
  {
    s_arrSDRAM[i] = 0;
  }

  //打印地址范围到终端和串口
  sprintf(s_arrStringBuff, "Addr: 0x%08X - 0x%08X\r\n", s_structGUIDev.SDRAMBeginAddr, s_structGUIDev.SDRAMEndAddr);
  s_structGUIDev.showLine(s_arrStringBuff);
  printf("%s", s_arrStringBuff);
}

/*********************************************************************************************************
* 函数名称：ReadWriteSDRAMTask
* 函数功能：读写SDRAM模块任务
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：每隔40毫秒执行一次
*********************************************************************************************************/
void ReadWriteSDRAMTask(void)
{
  GUITask(); //GUI任务
}

